Revit 2027 API
FilterNumericValueRule.GetEvaluator Method
 Gets the evaluator that implements the test for this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilterNumericRuleEvaluator GetEvaluator()
Public Function GetEvaluator As FilterNumericRuleEvaluator
public:
FilterNumericRuleEvaluator^ GetEvaluator()
member GetEvaluator : unit -> FilterNumericRuleEvaluator
Return Value
FilterNumericRuleEvaluator
See Also
Reference
FilterNumericValueRule Class
Autodesk.Revit.DB Namespace